{
    "base_model_name_or_path": "nvidia/nemotron-3-nano-30b",
    "peft_type": "LORA",
    "r": 32,
    "lora_alpha": 64,
    "target_modules": ".*\\.(in_proj|out_proj|up_proj|down_proj)$",
    "fan_in_fan_out": false,
    "bias": "none",
    "modules_to_save": null,
    "task_type": "CAUSAL_LM"
}